---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.SpecificHeat
source: html/5bb6c5f5-27af-9f63-503d-20a2fa9556fa.htm
---
# Autodesk.Revit.DB.SpecTypeId.SpecificHeat Property

Specific Heat, in discipline Energy.

## Syntax (C#)
```csharp
public static ForgeTypeId SpecificHeat { get; }
```